---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallTopOffset
source: html/279aa7e8-6103-0e7e-6c92-e155e3d2226a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallTopOffset Property

"Top Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId WallTopOffset { get; }
```